{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": false,
    "strip_accents": false,
    "lowercase": true
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": null,
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      ".": 5,
      "a": 6,
      "d": 7,
      "e": 8,
      "f": 9,
      "h": 10,
      "i": 11,
      "l": 12,
      "m": 13,
      "n": 14,
      "o": 15,
      "p": 16,
      "r": 17,
      "s": 18,
      "t": 19,
      "x": 20,
      "##x": 21,
      "##a": 22,
      "##m": 23,
      "##p": 24,
      "##l": 25,
      "##e": 26,
      "##i": 27,
      "##s": 28,
      "##t": 29,
      "##o": 30,
      "##n": 31,
      "##r": 32,
      "##h": 33,
      "##am": 34,
      "##pl": 35,
      "##is": 36,
      "##ti": 37,
      "##ampl": 38,
      "##ample": 39,
      "dis": 40,
      "ex": 41,
      "fo": 42,
      "is": 43,
      "sample": 44,
      "te": 45,
      "th": 46,
      "##xt": 47,
      "##ati": 48,
      "##ll": 49,
      "##on": 50,
      "##till": 51,
      "distill": 52,
      "example": 53,
      "for": 54,
      "text": 55,
      "this": 56,
      "##ation": 57,
      "distillation": 58
    }
  }
}